src/Documents/ТранспортнаяЛогистика/ТранспортнаяЛогистика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТранспортнаяЛогистика</name>
  <registerRecords>AccumulationRegister.ТранспортнаяЛогистикаЗаказы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Маршруты</name>
    <attributes>
      <name>Маршрут</name>
      <type>
        <types>CatalogRef.Маршруты</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.Водители</types>
      </type>
    </attributes>
    <attributes>
      <name>Автомобиль</name>
      <type>
        <types>CatalogRef.Автомобили</types>
      </type>
    </attributes>
    <attributes>
      <name>Тоннаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пробег</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Рейсы</name>
    <attributes>
      <name>Маршрут</name>
      <type>
        <types>CatalogRef.Маршруты</types>
      </type>
    </attributes>
    <attributes>
      <name>Рейс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тоннаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пробег</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставыРейсов</name>
    <attributes>
      <name>Маршрут</name>
      <type>
        <types>CatalogRef.Маршруты</types>
      </type>
    </attributes>
    <attributes>
      <name>Рейс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерВРейсе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТочкаМаршрута</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресJSON</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тоннаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыМаршрута</name>
    <attributes>
      <name>GUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.Доверенность</types>
        <types>DocumentRef.СчетНаОплатуПокупателю</types>
      </type>
    </attributes>
    <attributes>
      <name>Тоннаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ТранспортнаяЛогистикаЗаказы/ТранспортнаяЛогистикаЗаказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТранспортнаяЛогистикаЗаказы</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Тоннаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Наценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>АдресПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЛогистикиНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЛогистикиОкончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <type>
      <types>CatalogRef.Маршруты</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>Рейс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВРейсе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пробег</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументДвижения</name>
    <type>
      <types>DocumentRef.Доверенность</types>
      <types>DocumentRef.СчетНаОплатуПокупателю</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Грузоотправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ТранспортнаяЛогистика/Forms/ФормаТовара/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = "Товары точки маршрута: " + Параметры.ТочкаМаршрута;
	Масштаб = ?(Параметры.КомпактноеРазмещениеНаФорме, 85, 100);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивДокументов", Параметры.МассивДокументов);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТранспортнаяЛогистикаЗаказы.Номенклатура.Наименование КАК Наименование,
	|	ТранспортнаяЛогистикаЗаказы.Номенклатура КАК Товар,
	|	СУММА(ТранспортнаяЛогистикаЗаказы.Количество) КАК Количество,
	|	СУММА(ТранспортнаяЛогистикаЗаказы.Тоннаж) КАК Тоннаж,
	|	СУММА(ТранспортнаяЛогистикаЗаказы.Наценка) КАК Наценка
	|ИЗ
	|	РегистрНакопления.ТранспортнаяЛогистикаЗаказы КАК ТранспортнаяЛогистикаЗаказы
	|ГДЕ
	|	ТранспортнаяЛогистикаЗаказы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ТранспортнаяЛогистикаЗаказы.ДокументДвижения В(&МассивДокументов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТранспортнаяЛогистикаЗаказы.Номенклатура,
	|	ТранспортнаяЛогистикаЗаказы.Номенклатура.Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование,
	|	Количество УБЫВ";
	
	ТЗИтоги = Запрос.Выполнить().Выгрузить();
	
	Товары.Загрузить(ТЗИтоги);
	
	Если ТЗИтоги.Количество() > 0 тогда
		ТЗИтоги.Свернуть("","Тоннаж, Наценка");
		ИтогоТоннаж  = ТЗИтоги.Получить(0).Тоннаж;
		ИтогоНаценка = ТЗИтоги.Получить(0).Наценка;
	КонецЕсли;
	
КонецПроцедуры
